balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ256DA210.PIC
        <edc:SFRDef edc:access="-nnn-nnn-nnn-nnn" edc:cname="IPC21" edc:desc="" edc:impl="0x7777" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-100-100-100-100" edc:name="IPC21" edc:nzwidth="0x10" edc:por="-100-100-100-100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SI2C3IP" edc:desc="" edc:mask="0x7" edc:name="SI2C3IP" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MI2C3IP" edc:desc="" edc:mask="0x7" edc:name="MI2C3IP" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="USB1IP" edc:desc="" edc:mask="0x7" edc:name="USB1IP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U4ERIP" edc:desc="" edc:mask="0x7" edc:name="U4ERIP" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SI2C3IP0" edc:desc="" edc:mask="0x1" edc:name="SI2C3IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SI2C3IP1" edc:desc="" edc:mask="0x1" edc:name="SI2C3IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SI2C3IP2" edc:desc="" edc:mask="0x1" edc:name="SI2C3IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MI2C3IP0" edc:desc="" edc:mask="0x1" edc:name="MI2C3IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MI2C3IP1" edc:desc="" edc:mask="0x1" edc:name="MI2C3IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MI2C3IP2" edc:desc="" edc:mask="0x1" edc:name="MI2C3IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="USB1IP0" edc:desc="" edc:mask="0x1" edc:name="USB1IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="USB1IP1" edc:desc="" edc:mask="0x1" edc:name="USB1IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="USB1IP2" edc:desc="" edc:mask="0x1" edc:name="USB1IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U4ERIP0" edc:desc="" edc:mask="0x1" edc:name="U4ERIP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4ERIP1" edc:desc="" edc:mask="0x1" edc:name="U4ERIP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4ERIP2" edc:desc="" edc:mask="0x1" edc:name="U4ERIP2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SI2C3P0" edc:desc="" edc:mask="0x1" edc:name="SI2C3P0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SI2C3P1" edc:desc="" edc:mask="0x1" edc:name="SI2C3P1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SI2C3P2" edc:desc="" edc:mask="0x1" edc:name="SI2C3P2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MI2C3P0" edc:desc="" edc:mask="0x1" edc:name="MI2C3P0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MI2C3P1" edc:desc="" edc:mask="0x1" edc:name="MI2C3P1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MI2C3P2" edc:desc="" edc:mask="0x1" edc:name="MI2C3P2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SI2C3P" edc:desc="" edc:mask="0x7" edc:name="SI2C3P" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MI2C3P" edc:desc="" edc:mask="0x7" edc:name="MI2C3P" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn-nnn-nnn-nnn" edc:cname="IPC22" edc:desc="" edc:impl="0x7777" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-100-100-100-100" edc:name="IPC22" edc:nzwidth="0x10" edc:por="-100-100-100-100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U4RXIP" edc:desc="" edc:mask="0x7" edc:name="U4RXIP" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U4TXIP" edc:desc="" edc:mask="0x7" edc:name="U4TXIP" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SPF3IP" edc:desc="" edc:mask="0x7" edc:name="SPF3IP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SPI3IP" edc:desc="" edc:mask="0x7" edc:name="SPI3IP" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U4RXIP0" edc:desc="" edc:mask="0x1" edc:name="U4RXIP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4RXIP1" edc:desc="" edc:mask="0x1" edc:name="U4RXIP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4RXIP2" edc:desc="" edc:mask="0x1" edc:name="U4RXIP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U4TXIP0" edc:desc="" edc:mask="0x1" edc:name="U4TXIP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4TXIP1" edc:desc="" edc:mask="0x1" edc:name="U4TXIP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4TXIP2" edc:desc="" edc:mask="0x1" edc:name="U4TXIP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SPF3IP0" edc:desc="" edc:mask="0x1" edc:name="SPF3IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPF3IP1" edc:desc="" edc:mask="0x1" edc:name="SPF3IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPF3IP2" edc:desc="" edc:mask="0x1" edc:name="SPF3IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SPI3IP0" edc:desc="" edc:mask="0x1" edc:name="SPI3IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPI3IP1" edc:desc="" edc:mask="0x1" edc:name="SPI3IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPI3IP2" edc:desc="" edc:mask="0x1" edc:name="SPI3IP2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---------nnn-nnn" edc:cname="IPC23" edc:desc="" edc:impl="0x7777" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------100-100" edc:name="IPC23" edc:nzwidth="0x10" edc:por="---------100-100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OC9IP" edc:desc="" edc:mask="0x7" edc:name="OC9IP" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IC9IP" edc:desc="" edc:mask="0x7" edc:name="IC9IP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OC9IP0" edc:desc="" edc:mask="0x1" edc:name="OC9IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OC9IP1" edc:desc="" edc:mask="0x1" edc:name="OC9IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OC9IP2" edc:desc="" edc:mask="0x1" edc:name="OC9IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IC9IP0" edc:desc="" edc:mask="0x1" edc:name="IC9IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC9IP1" edc:desc="" edc:mask="0x1" edc:name="IC9IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC9IP2" edc:desc="" edc:mask="0x1" edc:name="IC9IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="-------------nnn" edc:cname="IPC25" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------100" edc:name="IPC25" edc:nzwidth="16" edc:por="-------------100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GFX1IP" edc:desc="" edc:mask="0x7" edc:name="GFX1IP" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="GFX1IP0" edc:desc="" edc:mask="0x1" edc:name="GFX1IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GFX1IP1" edc:desc="" edc:mask="0x1" edc:name="GFX1IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GFX1IP2" edc:desc="" edc:mask="0x1" edc:name="GFX1IP2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="8"/>
        <edc:SFRDef edc:access="r-n-rrrr-nnnnnnn" edc:cname="INTTREG" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0-0000-0000000" edc:name="INTTREG" edc:nzwidth="16" edc:por="0-0-0000-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VECNUM" edc:desc="" edc:mask="0x7f" edc:name="VECNUM" edc:nzwidth="7"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ILR" edc:desc="" edc:mask="0xf" edc:name="ILR" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="VHOLD" edc:desc="" edc:mask="0x1" edc:name="VHOLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CPUIRQ" edc:desc="" edc:mask="0x1" edc:name="CPUIRQ" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="VECNUM0" edc:desc="" edc:mask="0x1" edc:name="VECNUM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM1" edc:desc="" edc:mask="0x1" edc:name="VECNUM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM2" edc:desc="" edc:mask="0x1" edc:name="VECNUM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM3" edc:desc="" edc:mask="0x1" edc:name="VECNUM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM4" edc:desc="" edc:mask="0x1" edc:name="VECNUM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM5" edc:desc="" edc:mask="0x1" edc:name="VECNUM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM6" edc:desc="" edc:mask="0x1" edc:name="VECNUM6" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ILR0" edc:desc="" edc:mask="0x1" edc:name="ILR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ILR1" edc:desc="" edc:mask="0x1" edc:name="ILR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ILR2" edc:desc="" edc:mask="0x1" edc:name="ILR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ILR3" edc:desc="" edc:mask="0x1" edc:name="ILR3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="30"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="TMR1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="TMR1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TMR1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PR1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111111111111111" edc:name="PR1" edc:nzwidth="0x10" edc:por="1111111111111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PR1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
